In [2]:
import pandas as pd
import numpy as np

In [7]:
data =pd.Series(np.random.randn(9),index=[["a","a","a","b","b","c","c","d","d"],[1,2,3,1,3,1,2,2,3]])

In [8]:
data

a  1   -1.088854
   2   -0.854237
   3    0.144079
b  1   -0.813455
   3   -0.274358
c  1   -0.978613
   2    0.237228
d  2   -0.589032
   3    1.290113
dtype: float64

In [12]:
data["a":"c"]

a  1   -1.088854
   2   -0.854237
   3    0.144079
b  1   -0.813455
   3   -0.274358
c  1   -0.978613
   2    0.237228
dtype: float64

In [15]:
data[["a","c"]]

a  1   -1.088854
   2   -0.854237
   3    0.144079
c  1   -0.978613
   2    0.237228
dtype: float64

In [18]:
data.loc[:,2]

a   -0.854237
c    0.237228
d   -0.589032
dtype: float64

In [20]:
data["a"]

1   -1.088854
2   -0.854237
3    0.144079
dtype: float64

In [29]:
df= data.unstack()
df

          1         2         3
a -1.088854 -0.854237  0.144079
b -0.813455       NaN -0.274358
c -0.978613  0.237228       NaN
d       NaN -0.589032  1.290113

In [25]:
df1=df.stack()
df1

a  1   -1.088854
   2   -0.854237
   3    0.144079
b  1   -0.813455
   3   -0.274358
c  1   -0.978613
   2    0.237228
d  2   -0.589032
   3    1.290113
dtype: float64

In [34]:
data1 = pd.DataFrame(np.arange(12).reshape(4,3),index=[["a","a","b","b"],[1,2,1,2]],columns=[["ohio","ohio","colorado"],["green","red","green"]])
data1.index.names=["key1","key2"]
data1.columns.names=["state","color"]
data1

state      ohio     colorado
color     green red    green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [38]:
data1["ohio"]

color      green  red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [43]:
data1.swaplevel("key1","key2").sort_index(level=0)

state      ohio     colorado
color     green red    green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [45]:
data1.sum(level="key2")

state  ohio     colorado
color green red    green
key2
1         6   8       10
2        12  14       16

In [46]:
data1.sum(level="key1")

state  ohio     colorado
color green red    green
key1
a         3   5        7
b        15  17       19

In [47]:
data1.sum(level="color",axis=1)

color      green  red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [69]:
data2 = pd.DataFrame({"a":range(7),"b":range(7,0,-1),"c":["one","one","one","two","two","two","two"],"d":[0,1,2,0,1,2,3]})
data2

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [71]:
data3=data2.set_index(["c","d"])
data3

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [72]:
data3.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [68]:
data2=data2.set_index(["c","d"],drop=False)
data2

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [61]:
data3.reset_index()

ValueError: cannot insert d, already exists